Revit 2024 API
Material.ThermalAssetId Property
 The ElementId of the thermal PropertySetElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ElementId ThermalAssetId { get; set; }
Visual Basic
Public Property ThermalAssetId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ ThermalAssetId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Material Class
Autodesk.Revit.DB Namespace